AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВДороге.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВДороге</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДороги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДороги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проформа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвойс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДороги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидДороги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ИнвойсПродажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервироватьТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/StockAPI_Заказы/Ext/Module.bsl
// Заказы StockAPI: создание/изменение/получение исходящих инвойсов (проформ) с резервом.
// Расходные накладные создаются вручную в 1С на основании проформы.
// Зависимости: StockAPI_Утилиты, StockAPI_Справочники, StockAPI_Контрагенты, StockAPI_Цены

// ─── Точки входа (POST/PATCH/PUT/DELETE/GET /orders) ─────────────────────────

// POST /orders — создание проформы ИнвойсПродажи с резервированием остатков.
Функция СоздатьЗаказПокупателя(ДанныеЗапроса, КонтекстАвторизации) Экспорт
	
	Результат = Новый Структура("success, error, incomingNumber, orderNumber, orderDate, reserved", Ложь, "", "", "", Ложь);
	
	Если НЕ ДанныеЗапроса.Свойство("orderNo") Тогда
		Результат.Ошибки.Добавить("В запросе нет входящего номера заказа orderNo.");
		Возврат Результат;
	КонецЕсли;
	НайденныйДок = Документы.ИнвойсПродажи.НайтиПоРеквизиту("НомерВходящий", ДанныеЗапроса.orderNo);
	Если НайденныйДок <> Документы.ИнвойсПродажи.ПустаяСсылка() Тогда
		Результат.error = СтрШаблон("В 1С уже зарегистрирован заказ %1 (%2) под номером %3.", ДанныеЗапроса.orderNo, НайденныйДок.Дата, НайденныйДок.Номер);
		Возврат Результат;
	КонецЕсли;
	
	Контрагент = StockAPI_Контрагенты.НайтиКонтрагента(ДанныеЗапроса, КонтекстАвторизации.УчетнаяЗапись, Результат.error);
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Результат.error = "Не найден покупатель. Укажите customer (наименование) или customerCode (код).";
		Возврат Результат;
	КонецЕсли;
	
	Фирма = ПараметрыСеанса.Фирма; 
	
	Склад = StockAPI_Справочники.НайтиСклад(ДанныеЗапроса, КонтекстАвторизации.УчетнаяЗапись, Результат.error);
	Если Результат.error <> "" Тогда
		Возврат Результат;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда
	//	Возврат Результат;
	//КонецЕсли;
	
	// +++
	ПроверятьОстатки = ЛОЖЬ;
	// ---
	СтрокиЗаказа = СтрокиИнвойсаИзЗапроса(ДанныеЗапроса, Фирма, Склад, ПроверятьОстатки);
	Если СтрокиЗаказа.Ошибки.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(СтрокиЗаказа.Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокиЗаказа.Строки.Количество() = 0 Тогда
		Результат.error = "Список items пуст.";
		Возврат Результат;
	КонецЕсли;
	
	//ВидЦены = StockAPI_Цены.ВидЦеныИзПараметра(?(ДанныеЗапроса.Свойство("priceType"), ДанныеЗапроса.priceType, ""));
	ВидЦены = Контрагент.ВидЦены;
	Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Результат.error = "В 1С у контрагента не указан вид цен.";
		Возврат Результат;
	КонецЕсли;
	
	ИмяВидаЦены = Строка(ВидЦены);   
	Валюта = ВидЦены.Валюта;
	ЦеныПродажи = StockAPI_Цены.ЗагрузитьЦеныПродажи(НоменклатураИзСтрокЗаказа(СтрокиЗаказа.Строки), ВидЦены);
	
	ОшибкиЦен = StockAPI_Цены.ПроверитьЦеныСтрокЗаказа(СтрокиЗаказа.Строки, ЦеныПродажи, ИмяВидаЦены);
	Если ОшибкиЦен.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(ОшибкиЦен);
		Возврат Результат;
	КонецЕсли;
	
	//Валюта = ?(ДанныеЗапроса.Свойство("currency") И ЗначениеЗаполнено(ДанныеЗапроса.currency),
	//	Справочники.Валюты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.currency), Истина),
	//	Фирма.Валюта);
	//Если НЕ ЗначениеЗаполнено(Валюта) Тогда
	//	Валюта = Фирма.Валюта;
	//КонецЕсли;
	
	Док = Документы.ИнвойсПродажи.СоздатьДокумент();
	Док.Дата 				= ТекущаяДатаСеанса(); 
	Док.НомерВходящий		= ДанныеЗапроса.orderNo;
	Док.Фирма 				= Фирма;
	Док.Контрагент 			= Контрагент;
	//Док.Получатель 			= Контрагент;
	Док.Валюта 				= Валюта;
	Док.Склад 				= Склад;
	Док.Проформа 			= Перечисления.ВидыИнвойса.ЗаказПокупателя;
	Док.РезервироватьТовар 	= РезервированиеИзЗапроса(ДанныеЗапроса);
	ЗаполнитьТоварыИнвойса(Док, СтрокиЗаказа.Строки);
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Результат.error = "Не удалось провести инвойс: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Результат.success 			= Истина;
	Результат.incomingNumber	= Док.НомерВходящий;
	Результат.orderNumber 		= Док.Номер;
	Результат.orderDate 		= StockAPI_Утилиты.ДатаВСтроку(Док.Дата);
	Результат.reserved 			= Док.РезервироватьТовар И Док.Проведен;
	Возврат Результат;
	
КонецФункции

// PATCH /orders — полное редактирование проформы (заголовок + полная замена items).
Функция ИзменитьЗаказПокупателя(ДанныеЗапроса) Экспорт
	
	Результат = РезультатИзмененияЗаказа();
	
	Если ДанныеЗапроса = Неопределено Тогда
		Результат.error = "Тело запроса пустое.";
		Возврат Результат;
	КонецЕсли;
	
	СсылкаЗаказа = НайтиИнвойсДляРедактирования(ДанныеЗапроса, Результат);
	Если НЕ ЗначениеЗаполнено(СсылкаЗаказа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ДанныеЗапроса.Свойство("items") Тогда
		Результат.error = "В теле запроса нет массива items.";
		Возврат Результат;
	КонецЕсли;
	
	Док = СсылкаЗаказа.ПолучитьОбъект();
	БылПроведен = Док.Проведен;
	СтарыеТовары = Док.Товары.Выгрузить();
	
	Если НЕ ПрименитьЗаголовокИнвойсаИзЗапроса(Док, ДанныеЗапроса, Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Фирма = Док.Фирма;
	Склад = Док.Склад;
	
	СтрокиЗаказа = СтрокиИнвойсаИзЗапроса(ДанныеЗапроса, Фирма, Склад);
	Если СтрокиЗаказа.Ошибки.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(СтрокиЗаказа.Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокиЗаказа.Строки.Количество() = 0 Тогда
		Результат.error = "Список items пуст или все позиции отклонены.";
		Возврат Результат;
	КонецЕсли;
	
	ОшибкиЦен = ПроверитьЦеныСтрокЗаказаИзЗапроса(СтрокиЗаказа.Строки, ДанныеЗапроса, Склад);
	Если ОшибкиЦен.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(ОшибкиЦен);
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ СнятьПроведениеИнвойса(Док, БылПроведен, Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьТоварыИнвойса(Док, СтрокиЗаказа.Строки);
	
	Возврат ПровестиИнвойсИЗаполнитьРезультат(Док, Результат, СтарыеТовары, БылПроведен);
	
КонецФункции

// PUT /orders — добавление позиций в существующую проформу.
Функция ДобавитьПозицииВЗаказ(ДанныеЗапроса) Экспорт
	
	Результат = РезультатИзмененияЗаказа();
	
	Если ДанныеЗапроса = Неопределено Тогда
		Результат.error = "Тело запроса пустое.";
		Возврат Результат;
	КонецЕсли;
	
	СсылкаЗаказа = НайтиИнвойсДляРедактирования(ДанныеЗапроса, Результат);
	Если НЕ ЗначениеЗаполнено(СсылкаЗаказа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ДанныеЗапроса.Свойство("items") Тогда
		Результат.error = "В теле запроса нет массива items.";
		Возврат Результат;
	КонецЕсли;
	
	Док = СсылкаЗаказа.ПолучитьОбъект();
	Фирма = Док.Фирма;
	Склад = Док.Склад;
	БылПроведен = Док.Проведен;
	СтарыеТовары = Док.Товары.Выгрузить();
	
	СтрокиНовые = СтрокиИнвойсаИзЗапроса(ДанныеЗапроса, Фирма, Склад, Ложь);
	Если СтрокиНовые.Ошибки.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(СтрокиНовые.Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокиНовые.Строки.Количество() = 0 Тогда
		Результат.error = "Список items пуст или все позиции отклонены.";
		Возврат Результат;
	КонецЕсли;
	
	ТребуемыеКоличества = ТребуемыеКоличестваИзТабличнойЧасти(Док.Товары);
	ДобавитьТребуемыеКоличества(ТребуемыеКоличества, СтрокиНовые.Строки);
	ОшибкиОстатков = ПроверитьОстаткиНоменклатуры(ТребуемыеКоличества, Фирма, Склад);
	Если ОшибкиОстатков.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(ОшибкиОстатков);
		Возврат Результат;
	КонецЕсли;
	
	ОшибкиЦен = ПроверитьЦеныСтрокЗаказаИзЗапроса(СтрокиНовые.Строки, ДанныеЗапроса, Склад);
	Если ОшибкиЦен.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(ОшибкиЦен);
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ СнятьПроведениеИнвойса(Док, БылПроведен, Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрЗаказа Из СтрокиНовые.Строки Цикл
		НовСтр = Док.Товары.Добавить();
		НовСтр.Номенклатура = СтрЗаказа.Номенклатура;
		НовСтр.Количество = СтрЗаказа.Количество;
		НовСтр.Цена = СтрЗаказа.Цена;
		НовСтр.Сумма = СтрЗаказа.Цена * НовСтр.Количество;
	КонецЦикла;
	
	Возврат ПровестиИнвойсИЗаполнитьРезультат(Док, Результат, СтарыеТовары, БылПроведен);
	
КонецФункции

// DELETE /orders — удаление позиций; если позиций не осталось — удаление инвойса целиком.
Функция УдалитьПозицииИзЗаказа(ДанныеЗапроса) Экспорт
	
	Результат = РезультатИзмененияЗаказа();
	Результат.Вставить("deleted", Ложь);
	
	Если ДанныеЗапроса = Неопределено Тогда
		Результат.error = "Тело запроса пустое.";
		Возврат Результат;
	КонецЕсли;
	
	СсылкаЗаказа = НайтиИнвойсДляРедактирования(ДанныеЗапроса, Результат);
	Если НЕ ЗначениеЗаполнено(СсылкаЗаказа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	НоменклатурыУдаления = НоменклатурыДляУдаленияИзЗапроса(ДанныеЗапроса);
	Если НоменклатурыУдаления.Ошибки.Количество() > 0 Тогда
		Результат.error = StockAPI_Утилиты.ТекстОшибокСписка(НоменклатурыУдаления.Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Если НоменклатурыУдаления.Номенклатуры.Количество() = 0 Тогда
		Результат.error = "Список items пуст или все позиции отклонены.";
		Возврат Результат;
	КонецЕсли;
	
	НомерЗаказа = СсылкаЗаказа.Номер;
	УдалениеВсегоИнвойса = ВсеПозицииИнвойсаВЗапросе(СсылкаЗаказа, НоменклатурыУдаления.Номенклатуры);
	
	// Все позиции инвойса — только пометка на удаление, табличную часть не меняем.
	Если УдалениеВсегоИнвойса Тогда
		Возврат ПометитьИнвойсНаУдаление(СсылкаЗаказа, НомерЗаказа, Результат);
	КонецЕсли;
	
	Док = СсылкаЗаказа.ПолучитьОбъект();
	БылПроведен = Док.Проведен;
	СтарыеТовары = Док.Товары.Выгрузить();
	
	Если НЕ СнятьПроведениеИнвойса(Док, БылПроведен, Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Номенклатура Из НоменклатурыУдаления.Номенклатуры Цикл
		СтрокиДляУдаления = Док.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Для Каждого СтрокаТЧ Из СтрокиДляУдаления Цикл
			Док.Товары.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	Если Док.Товары.Количество() = 0 Тогда
		Результат.error = "Нельзя оставить инвойс без позиций. Для удаления заказа укажите все позиции в items.";
		Возврат Результат;
	КонецЕсли;
	
	РезультатПроведения = ПровестиИнвойсИЗаполнитьРезультат(Док, Результат, СтарыеТовары, БылПроведен);
	РезультатПроведения.deleted = Ложь;
	Возврат РезультатПроведения;
	
КонецФункции

// GET /orders — список проформ по номеру (один) или по покупателю + дате (с пагинацией). 
//
Функция ПолучитьЗаказы(Запрос, ДанныеЗапроса, УчетнаяЗапись) Экспорт
	
	Результат = Новый Структура("Тело, Ошибка, НеНайден", Неопределено, "", Ложь);
	Фильтр = ПараметрыПоискаЗаказов(Запрос, ДанныеЗапроса, УчетнаяЗапись);
	Если Фильтр.Ошибка <> "" Тогда
		Результат.Ошибка = Фильтр.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Результат.Ошибка = Пагинация.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	Если Фильтр.Режим = "single" Тогда
		
		СсылкаЗаказа = НайтиИнвойсПродажи(Фильтр.orderNumber, Фильтр.orderDate, Результат.Ошибка);
		Если НЕ ЗначениеЗаполнено(СсылкаЗаказа) Тогда
			Результат.Ошибка = СтрШаблон("Заказ %1 не найден.", Фильтр.orderNumber);
			Результат.НеНайден = Истина;
			Возврат Результат;
		КонецЕсли;
		
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(СтруктураЗаказаJSON(СсылкаЗаказа, СтрокиЗаказовПоДокументам(СсылкаЗаказа)));
		
		ТелоОтвета = Новый Структура;
		ТелоОтвета.Вставить("page", 1);
		ТелоОтвета.Вставить("pageSize", Пагинация.pageSize);
		ТелоОтвета.Вставить("totalItems", 1);
		ТелоОтвета.Вставить("totalPages", 1);
		ТелоОтвета.Вставить("items", МассивЗаказов);
		Результат.Тело = ТелоОтвета;
		Возврат Результат;
		
	КонецЕсли;
	
	ВсегоЗаказов = КоличествоЗаказовПокупателя(Фильтр.Контрагент, Фильтр.dateFrom, Фильтр.dateTo);
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоЗаказов, Пагинация.pageSize);
	Пропустить = (Пагинация.page - 1) * Пагинация.pageSize;
	СсылкиЗаказов = ЗаказыПокупателяСтраница(Фильтр.Контрагент, Фильтр.dateFrom, Фильтр.dateTo, Пагинация.pageSize, Пропустить);
	СтрокиПоЗаказам = СтрокиЗаказовПоДокументам(СсылкиЗаказов);
	
	МассивЗаказов = Новый Массив;
	Для Каждого СсылкаЗаказа Из СсылкиЗаказов Цикл
		МассивЗаказов.Добавить(СтруктураЗаказаJSON(СсылкаЗаказа, СтрокиПоЗаказам));
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", Пагинация.page);
	ТелоОтвета.Вставить("pageSize", Пагинация.pageSize);
	ТелоОтвета.Вставить("totalItems", ВсегоЗаказов);
	ТелоОтвета.Вставить("totalPages", ВсегоСтраниц);
	ТелоОтвета.Вставить("items", МассивЗаказов);
	Результат.Тело = ТелоОтвета;
	Возврат Результат;
	
КонецФункции

// ─── Параметры поиска и чтение заказов ───────────────────────────────────────

Функция ПараметрыПоискаЗаказов(Запрос, ДанныеЗапроса, УчетнаяЗапись)
	
	Результат = Новый Структура("Режим, orderNumber, orderDate, Контрагент, dateFrom, dateTo, Ошибка", "list", "", '00010101', Справочники.Контрагенты.ПустаяСсылка(), '00010101', '00010101', "");
	
	НомерЗаказа = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "orderNumber");
	Если НомерЗаказа = "" Тогда
		НомерЗаказа = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "number");
	КонецЕсли;
	
	Если НомерЗаказа <> "" Тогда 
		Результат.Режим = "single";
		Результат.orderNumber = НомерЗаказа;
		ДатаЗаказа = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "orderDate");
		Если ДатаЗаказа = Неопределено Тогда
			ДатаЗаказа = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "date");
		КонецЕсли;
		Если ДатаЗаказа <> Неопределено Тогда
			Результат.orderDate = ДатаЗаказа;
		КонецЕсли;   
		Возврат Результат;
	КонецЕсли;
	
	//////Результат = Новый Структура("Режим, orderNumber, Контрагент, dateFrom, dateTo, Ошибка", "list", "", '00010101', Справочники.Контрагенты.ПустаяСсылка(), '00010101', '00010101', "");
	//////
	//////НомерЗаказа = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "orderNumber");
	//////Если НомерЗаказа = "" Тогда
	//////	Результат.Режим = "multy";
	//////	Контрагент = StockAPI_Контрагенты.НайтиКонтрагента(ДанныеЗапроса, УчетнаяЗапись, Результат.Ошибка); 
	//////	
	//////Иначе
	//////	Результат.Режим = "single";
	//////	Результат.orderNumber = НомерЗаказа;  
	//////	
	//////КонецЕсли;	
	
	
	
	
	
	Результат.Режим = "multiple";
	
	Контрагент = КонтрагентИзПараметровЗапроса(Запрос); 
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Результат.Ошибка = "Укажите orderNumber, либо customer (или customerCode) вместе с dateFrom и dateTo.";
		Возврат Результат;
	КонецЕсли;
	
	ДатаНачала = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "dateFrom");
	Если ДатаНачала = Неопределено Тогда
		ДатаНачала = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "from");
	КонецЕсли;
	ДатаОкончания = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "dateTo");
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "to");
	КонецЕсли;
	
	Если ДатаНачала = Неопределено Или ДатаОкончания = Неопределено Тогда
		Результат.Ошибка = "Для поиска по покупателю укажите dateFrom и dateTo (формат yyyy-MM-dd).";
		Возврат Результат;
	КонецЕсли;
	
	Если ДатаНачала > ДатаОкончания Тогда
		Результат.Ошибка = "dateFrom не может быть позже dateTo.";
		Возврат Результат;
	КонецЕсли;
	
	Результат.Контрагент = Контрагент;
	Результат.dateFrom = НачалоДня(ДатаНачала);
	Результат.dateTo = КонецДня(ДатаОкончания);
	Возврат Результат;
	
КонецФункции

Функция КонтрагентИзПараметровЗапроса(Запрос)
	
	КодСтрока = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "customerCode");
	Если КодСтрока = "" Тогда
		КодСтрока = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "code");
	КонецЕсли;
	
	Если КодСтрока <> "" Тогда
		Попытка
			Контрагент = Справочники.Контрагенты.НайтиПоКоду(Число(КодСтрока));
			Если ЗначениеЗаполнено(Контрагент) И НЕ Контрагент.ЭтоГруппа Тогда
				Возврат Контрагент;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ИмяПокупателя = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "customer");
	Если ИмяПокупателя <> "" Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ИмяПокупателя, Истина);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ДатаЗаказаИзДанных(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат '00010101';
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("orderDate") И СокрЛП(Строка(ДанныеЗапроса.orderDate)) <> "" Тогда
		СтрокаДаты = СокрЛП(Строка(ДанныеЗапроса.orderDate));
		Если СтрДлина(СтрокаДаты) >= 10 Тогда
			СтрокаДаты = Лев(СтрокаДаты, 10);
		КонецЕсли;
		Попытка
			Возврат Дата(СтрокаДаты);
		Исключение
			Возврат '00010101';
		КонецПопытки;
	КонецЕсли;
	
	Возврат '00010101';
	
КонецФункции

Функция НомерЗаказаИзДанных(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("orderNumber") Тогда
		Возврат СокрЛП(Строка(ДанныеЗапроса.orderNumber));
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("number") Тогда
		Возврат СокрЛП(Строка(ДанныеЗапроса.number));
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция НайтиИнвойсПродажи(НомерЗаказа, ДатаЗаказа = '00010101', Ошибка)
	
	Если СокрЛП(НомерЗаказа) = "" Тогда
		Ошибка = "Номер заказа пустой."; 
		Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	КонецЕсли;
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Номер", 		НомерЗаказа);
	Запр.УстановитьПараметр("Дата", 		ДатаЗаказа);
	Запр.УстановитьПараметр("ПустаяДата", 	Дата(1,1,1));
	Запр.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ИнвойсПродажи.Ссылка КАК Ссылка,
	             |	ИнвойсПродажи.ПометкаУдаления КАК ПометкаУдаления
	             |ИЗ
	             |	Документ.ИнвойсПродажи КАК ИнвойсПродажи
	             |ГДЕ
	             |	ИнвойсПродажи.Номер = &Номер
	             |	И ВЫБОР
	             |			КОГДА &Дата = &ПустаяДата
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ ИнвойсПродажи.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	             |		КОНЕЦ";
    РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ошибка = СтрШаблон("Заказ %1 удален.", НомерЗаказа); 
		Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ПометкаУдаления Тогда
			Ошибка = СтрШаблон("Заказ %1 удален.", НомерЗаказа); 
			Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
		Иначе 
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	
	//Зап = Новый Запрос;
	//Зап.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Inv.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ИнвойсПродажи КАК Inv
	//|ГДЕ
	//|	Inv.Номер = &Номер
	//|	И Inv.Проформа = ЗНАЧЕНИЕ(Перечисление.ВидыИнвойса.Проформа)
	//|	И НЕ Inv.ПометкаУдаления
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Inv.Дата УБЫВ";
	//Зап.УстановитьПараметр("Номер", СокрЛП(НомерЗаказа));
	//
	//Выборка = Зап.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.Ссылка;
	//КонецЕсли;
	
	//Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	
КонецФункции

Функция КоличествоЗаказовПокупателя(Контрагент, ДатаНачала, ДатаОкончания)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Inv.Ссылка) КАК Количество
	|ИЗ
	|	Документ.ИнвойсПродажи КАК Inv
	|ГДЕ
	|	Inv.Контрагент = &Контрагент
	|	И Inv.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Inv.Проформа = ЗНАЧЕНИЕ(Перечисление.ВидыИнвойса.Проформа)
	|	И НЕ Inv.ПометкаУдаления";
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	Зап.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Зап.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЗаказыПокупателяСтраница(Контрагент, ДатаНачала, ДатаОкончания, РазмерСтраницы, Пропустить)
	
	МассивЗаказов = Новый Массив;
	
	Если РазмерСтраницы <= 0 Тогда
		Возврат МассивЗаказов;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	|	Inv.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИнвойсПродажи КАК Inv
	|ГДЕ
	|	Inv.Контрагент = &Контрагент
	|	И Inv.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Inv.Проформа = ЗНАЧЕНИЕ(Перечисление.ВидыИнвойса.Проформа)
	|	И НЕ Inv.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Inv.Дата УБЫВ,
	|	Inv.Номер УБЫВ";
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	Зап.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Зап.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивЗаказов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивЗаказов;
	
КонецФункции

Функция СтрокиЗаказовПоДокументам(СсылкиЗаказов)
	
	Результат = Новый Соответствие;
	
	МассивСсылок = Новый Массив;
	Если ТипЗнч(СсылкиЗаказов) = Тип("Массив") Тогда
		МассивСсылок = СсылкиЗаказов;
	ИначеЕсли ЗначениеЗаполнено(СсылкиЗаказов) Тогда
		МассивСсылок.Добавить(СсылкиЗаказов);
	КонецЕсли;
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура.Код КАК КодНоменклатуры,
	|	Товары.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена
	|ИЗ
	|	Документ.ИнвойсПродажи.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В (&Ссылки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Ссылка,
	|	Товары.НомерСтроки";
	Зап.УстановитьПараметр("Ссылки", МассивСсылок);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивСтрок = Результат.Получить(Выборка.Ссылка);
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			Результат.Вставить(Выборка.Ссылка, МассивСтрок);
		КонецЕсли;
		
		СтрокаJSON = Новый Структура;
		СтрокаJSON.Вставить("item", Строка(Выборка.НаименованиеНоменклатуры));
		СтрокаJSON.Вставить("itemCode", Формат(Выборка.КодНоменклатуры, "ЧГ=0"));
		СтрокаJSON.Вставить("qty", Выборка.Количество);
		СтрокаJSON.Вставить("price", Выборка.Цена);
		МассивСтрок.Добавить(СтрокаJSON);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураЗаказаJSON(СсылкаЗаказа, СтрокиПоЗаказам)
	
	Заказ = Новый Структура;
	Заказ.Вставить("orderNumber", СсылкаЗаказа.Номер);
	Заказ.Вставить("orderDate", StockAPI_Утилиты.ДатаВСтроку(СсылкаЗаказа.Дата));
	Заказ.Вставить("customer", Строка(СсылкаЗаказа.Контрагент));
	Заказ.Вставить("customerCode", StockAPI_Утилиты.КодВСтроку(СсылкаЗаказа.Контрагент.Код));
	Заказ.Вставить("warehouse", Строка(СсылкаЗаказа.Склад));
	Заказ.Вставить("warehouseCode", StockAPI_Утилиты.КодВСтроку(СсылкаЗаказа.Склад.Код));
	//Заказ.Вставить("firm", Строка(СсылкаЗаказа.Фирма));
	Заказ.Вставить("currency", Строка(СсылкаЗаказа.Валюта));
	Заказ.Вставить("posted", СсылкаЗаказа.Проведен);
	//Заказ.Вставить("proforma", СсылкаЗаказа.Проформа = Перечисления.ВидыИнвойса.Проформа);
	Заказ.Вставить("reserved", СсылкаЗаказа.РезервироватьТовар И СсылкаЗаказа.Проведен);
	
	Статус = РаботаСИнвойсами.ПолучитьСтатусИнвойсаПродажи(СсылкаЗаказа);
	//СсылкаРасходной = РасходнаяНакладнаяПоИнвойсу(СсылкаЗаказа);
	//Отгружен = ЗначениеЗаполнено(СсылкаРасходной);
	//Заказ.Вставить("shipped", Отгружен);
	//Заказ.Вставить("finalized", Отгружен);
	//Заказ.Вставить("deliveryNoteNumber", ?(Отгружен, СсылкаРасходной.Номер, ""));
	//Заказ.Вставить("deliveryNoteDate", ?(Отгружен, Формат(СсылкаРасходной.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss"), ""));
	Заказ.Вставить("status", Строка(Статус.Состояние));
	Заказ.Вставить("statusDate", StockAPI_Утилиты.ДатаВСтроку(Статус.Зарегистрировано));
	
	МассивСтрок = СтрокиПоЗаказам.Получить(СсылкаЗаказа);
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = Новый Массив;
	КонецЕсли;
	Заказ.Вставить("items", МассивСтрок);
	
	Возврат Заказ;
	
КонецФункции
Процедура ВосстановитьИнвойсПослеОшибки(Док, СтарыеТовары, БылПроведен)
	
	Док.Товары.Загрузить(СтарыеТовары);
	Если БылПроведен Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	Иначе
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// ─── Редактирование инвойса (PATCH/PUT/DELETE) ───────────────────────────────

Функция РезультатИзмененияЗаказа()
	
	Возврат Новый Структура("success, error, orderNumber, orderDate, reserved, НеНайден, Отгружен", Ложь, "", "", "", Ложь, Ложь, Ложь);
	
КонецФункции

Функция НайтиИнвойсДляРедактирования(ДанныеЗапроса, Результат)
	
	НомерЗаказа = НомерЗаказаИзДанных(ДанныеЗапроса);
	Если НомерЗаказа = "" Тогда
		Результат.error = "Укажите orderNumber (номер заказа).";
		Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	КонецЕсли;
	
	ДатаЗаказа = ДатаЗаказаИзДанных(ДанныеЗапроса);
	СсылкаЗаказ = НайтиИнвойсПродажи(НомерЗаказа, ДатаЗаказа, Результат.error);
	//Если НЕ ЗначениеЗаполнено(СсылкаЗаказа) Тогда
	//	Результат.error = СтрШаблон("Заказ %1 не найден.", НомерЗаказа);
	//	Результат.НеНайден = Истина;
	//	Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	//КонецЕсли;
	
	
	
	Если ЕстьРасходнаяНакладнаяПоИнвойсу(СсылкаЗаказ) Тогда
		Результат.error = "Невозможно изменить отгруженный заказ: к инвойсу уже создана расходная накладная.";
		Результат.Отгружен = Истина;
		Возврат Документы.ИнвойсПродажи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СсылкаЗаказ;
	
КонецФункции

Функция РасходнаяНакладнаяПоИнвойсу(СсылкаИнвойса)
	
	Если НЕ ЗначениеЗаполнено(СсылкаИнвойса) Тогда
		Возврат Документы.РасходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РН.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РН
	|ГДЕ
	|	РН.ДокументОснование = &Инвойс
	|	И НЕ РН.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РН.Дата УБЫВ";
	Зап.УстановитьПараметр("Инвойс", СсылкаИнвойса);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.РасходнаяНакладная.ПустаяСсылка();
	
КонецФункции

Функция ЕстьРасходнаяНакладнаяПоИнвойсу(СсылкаИнвойса)
	
	Возврат ЗначениеЗаполнено(РасходнаяНакладнаяПоИнвойсу(СсылкаИнвойса));
	
КонецФункции

Функция ПрименитьЗаголовокИнвойсаИзЗапроса(Док, ДанныеЗапроса, Результат)
	
	Если ДанныеЗапроса.Свойство("customer")
		Или ДанныеЗапроса.Свойство("customerCode")
		Или ДанныеЗапроса.Свойство("counterparty")
		Или ДанныеЗапроса.Свойство("counterpartyCode") Тогда
		
		Контрагент = StockAPI_Контрагенты.НайтиКонтрагента(ДанныеЗапроса);
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Результат.error = "Не найден покупатель. Укажите customer (наименование) или customerCode (код).";
			Возврат Ложь;
		КонецЕсли;
		Док.Контрагент = Контрагент;
		Док.Получатель = Контрагент;
	КонецЕсли;
	
	Фирма = Док.Фирма;
	Если ДанныеЗапроса.Свойство("firm") И СокрЛП(ДанныеЗапроса.firm) <> "" Тогда
		//Фирма = StockAPI_Справочники.НайтиФирму(ДанныеЗапроса);  
		Фирма = ПараметрыСеанса.Фирма;
		Если НЕ ЗначениеЗаполнено(Фирма) Тогда
			Результат.error = "Не найдена фирма. Укажите firm (наименование).";
			Возврат Ложь;
		КонецЕсли;
		Док.Фирма = Фирма;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("warehouse") И СокрЛП(ДанныеЗапроса.warehouse) <> "" Тогда
		Склад = StockAPI_Справочники.НайтиСклад(ДанныеЗапроса, Фирма);
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Результат.error = "Не найден склад. Укажите warehouse (наименование склада).";
			Возврат Ложь;
		КонецЕсли;
		Док.Склад = Склад;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("currency") И СокрЛП(Строка(ДанныеЗапроса.currency)) <> "" Тогда
		Валюта = Справочники.Валюты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.currency), Истина);
		Если ЗначениеЗаполнено(Валюта) Тогда
			Док.Валюта = Валюта;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("reserve") Или ДанныеЗапроса.Свойство("reserved") Тогда
		Док.РезервироватьТовар = РезервированиеИзЗапроса(ДанныеЗапроса);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СнятьПроведениеИнвойса(Док, БылПроведен, Результат)
	
	Если НЕ БылПроведен Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
		Результат.error = "Не удалось снять проведение инвойса: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПровестиИнвойсИЗаполнитьРезультат(Док, Результат, СтарыеТовары, БылПроведен)
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВосстановитьИнвойсПослеОшибки(Док, СтарыеТовары, БылПроведен);
		Результат.error = "Не удалось провести инвойс: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Результат.success = Истина;
	Результат.orderNumber = Док.Номер;
	Результат.orderDate = StockAPI_Утилиты.ДатаВСтроку(Док.Дата);
	Результат.reserved = Док.РезервироватьТовар И Док.Проведен;
	Возврат Результат;
	
КонецФункции

Функция ПометитьИнвойсНаУдаление(СсылкаЗаказа, НомерЗаказа, Результат)
	
	// Только пометка на удаление (как вручную). Резерв снимается платформой автоматически.
	Попытка
		Док = СсылкаЗаказа.ПолучитьОбъект();
		Если НЕ Док.ПометкаУдаления Тогда
			Док.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	Исключение
		Результат.error = "Не удалось пометить инвойс на удаление: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Результат.success = Истина;
	Результат.deleted = Истина;
	Результат.orderNumber = НомерЗаказа;
	Результат.orderDate = "";
	Результат.reserved = Ложь;
	Возврат Результат;
	
КонецФункции

Функция ПроверитьЦеныСтрокЗаказаИзЗапроса(СтрокиЗаказа, ДанныеЗапроса, Склад = Неопределено)
	
	ВидЦены = StockAPI_Цены.ВидЦеныИзПараметра(?(ДанныеЗапроса.Свойство("priceType"), ДанныеЗапроса.priceType, ""));
	ИмяВидаЦены = Строка(ВидЦены);
	ЦеныПродажи = StockAPI_Цены.ЗагрузитьЦеныПродажи(КонецДня(ТекущаяДатаСеанса()), НоменклатураИзСтрокЗаказа(СтрокиЗаказа), ВидЦены);
	Возврат StockAPI_Цены.ПроверитьЦеныСтрокЗаказа(СтрокиЗаказа, ЦеныПродажи, ИмяВидаЦены);
	
КонецФункции

Функция ТребуемыеКоличестваИзТабличнойЧасти(ТабличнаяЧасть)
	
	ТребуемыеКоличества = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если СтрокаТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущееКоличество = ТребуемыеКоличества.Получить(СтрокаТЧ.Номенклатура);
		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;
		ТребуемыеКоличества.Вставить(СтрокаТЧ.Номенклатура, ТекущееКоличество + СтрокаТЧ.Количество);
		
	КонецЦикла;
	
	Возврат ТребуемыеКоличества;
	
КонецФункции

Процедура ДобавитьТребуемыеКоличества(ТребуемыеКоличества, СтрокиЗаказа)
	
	Для Каждого Стр Из СтрокиЗаказа Цикл
		
		Если Стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущееКоличество = ТребуемыеКоличества.Получить(Стр.Номенклатура);
		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;
		ТребуемыеКоличества.Вставить(Стр.Номенклатура, ТекущееКоличество + Стр.Количество);
		
	КонецЦикла;
	
КонецПроцедуры

// Истина, если в запросе перечислены все номенклатуры инвойса — документ помечается на удаление.
Функция ВсеПозицииИнвойсаВЗапросе(СсылкаЗаказа, НоменклатурыУдаления)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ИнвойсПродажи.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	Зап.УстановитьПараметр("Ссылка", СсылкаЗаказа);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НоменклатурыИнвойса = Новый Соответствие;
	НоменклатурыИнвойса.Вставить(Выборка.Номенклатура, Истина);
	Пока Выборка.Следующий() Цикл
		НоменклатурыИнвойса.Вставить(Выборка.Номенклатура, Истина);
	КонецЦикла;
	
	НоменклатурыЗапроса = Новый Соответствие;
	Для Каждого Номенклатура Из НоменклатурыУдаления Цикл
		НоменклатурыЗапроса.Вставить(Номенклатура, Истина);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из НоменклатурыИнвойса Цикл
		Если НоменклатурыЗапроса.Получить(КлючЗначение.Ключ) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючЗначение Из НоменклатурыЗапроса Цикл
		Если НоменклатурыИнвойса.Получить(КлючЗначение.Ключ) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция НоменклатурыДляУдаленияИзЗапроса(ДанныеЗапроса)
	
	Результат = Новый Структура("Номенклатуры, Ошибки", Новый Массив, Новый СписокЗначений);
	Уникальные = Новый Соответствие;
	
	Если НЕ ДанныеЗапроса.Свойство("items") Тогда
		Результат.Ошибки.Добавить("В теле запроса нет массива items.");
		Возврат Результат;
	КонецЕсли;
	
	Позиции = ДанныеЗапроса.items;
	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		Результат.Ошибки.Добавить("Поле items должно быть массивом.");
		Возврат Результат;
	КонецЕсли;
	
	НомерПозиции = 0;
	Для Каждого Позиция Из Позиции Цикл
		
		НомерПозиции = НомерПозиции + 1;
		
		Если ТипЗнч(Позиция) <> Тип("Структура") Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: неверный формат позиции.", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Номенклатура = НайтиНоменклатуруПоПозиции(Позиция);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: укажите itemCode или item (наименование).", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Если Уникальные.Получить(Номенклатура) = Неопределено Тогда
			Уникальные.Вставить(Номенклатура, Истина);
			Результат.Номенклатуры.Добавить(Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// ─── Строки инвойса из запроса ───────────────────────────────────────────────

Функция РезервированиеИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("reserve") Тогда
		Возврат ДанныеЗапроса.reserve = Истина;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("reserved") Тогда
		Возврат ДанныеЗапроса.reserved = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьТоварыИнвойса(Док, Строки)
	
	Док.Товары.Очистить();
	Для Каждого СтрЗаказа Из Строки Цикл
		НовСтр = Док.Товары.Добавить();
		НовСтр.Номенклатура = СтрЗаказа.Номенклатура;
		НовСтр.Количество = СтрЗаказа.Количество;
		НовСтр.Цена = СтрЗаказа.Цена;
		НовСтр.Сумма = СтрЗаказа.Цена * НовСтр.Количество;
	КонецЦикла;
	
КонецПроцедуры

// Разбирает массив items: только номенклатура + qty + price, без серий и партий.
// ПроверятьОстатки = Ложь — для PUT, когда остатки проверяются отдельно по сумме строк.
Функция СтрокиИнвойсаИзЗапроса(ДанныеЗапроса, Фирма, Склад, ПроверятьОстатки = Истина)
	
	Результат = Новый Структура("Строки, Ошибки", Новый Массив, Новый СписокЗначений);
	
	Если НЕ ДанныеЗапроса.Свойство("items") Тогда
		Результат.Ошибки.Добавить("В теле запроса нет массива items.");
		Возврат Результат;
	КонецЕсли;
	
	Позиции = ДанныеЗапроса.items;
	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		Результат.Ошибки.Добавить("Поле items должно быть массивом.");
		Возврат Результат;
	КонецЕсли;
	
	ТребуемыеКоличества = Новый Соответствие;
	НомерПозиции = 0;
	
	Для Каждого Позиция Из Позиции Цикл
		
		НомерПозиции = НомерПозиции + 1;
		
		Если ТипЗнч(Позиция) <> Тип("Структура") Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: неверный формат позиции.", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		//Если ПозицияСодержитПартиюИлиСерию(Позиция) Тогда
		//	Результат.Ошибки.Добавить(СтрШаблон("Строка %1: serial, batch и batchCode не поддерживаются. Укажите itemCode или item.", НомерПозиции));
		//	Продолжить;
		//КонецЕсли;
		
		Количество = 1;
		Если Позиция.Свойство("qty") Тогда
			Количество = Число(Позиция.qty);
		КонецЕсли;
		Если Количество <= 0 Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: qty должно быть больше 0.", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Цена = StockAPI_Цены.ЦенаИзПозицииЗапроса(Позиция);
		Если Цена <= 0 Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: укажите price (должна совпадать с salePrice из /balances).", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Номенклатура = НайтиНоменклатуруПоПозиции(Позиция);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: укажите itemCode или item (наименование).", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		СтрЗаказа = Новый Структура("НомерПозиции, Номенклатура, Количество, Цена",
									НомерПозиции, Номенклатура, Количество, Цена);
		Результат.Строки.Добавить(СтрЗаказа);
		
		Если Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущееКоличество = ТребуемыеКоличества.Получить(Номенклатура);
		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;
		ТребуемыеКоличества.Вставить(Номенклатура, ТекущееКоличество + Количество);
		
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() = 0 И ПроверятьОстатки Тогда
		ОшибкиОстатков = ПроверитьОстаткиНоменклатуры(ТребуемыеКоличества, Фирма, Склад);
		Для Каждого Ошибка Из ОшибкиОстатков Цикл
			Результат.Ошибки.Добавить(Ошибка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПозицияСодержитПартиюИлиСерию(Позиция)
	
	Если Позиция.Свойство("serial") И СокрЛП(Позиция.serial) <> "" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Позиция.Свойство("batch") И СокрЛП(Позиция.batch) <> "" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Позиция.Свойство("batchCode") И СокрЛП(Строка(Позиция.batchCode)) <> "" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьОстаткиНоменклатуры(ТребуемыеКоличества, Фирма, Склад)
	
	Ошибки = Новый Массив;
	
	Для Каждого Пара Из ТребуемыеКоличества Цикл
		
		Доступно = ДоступныйОстатокНоменклатуры(Фирма, Склад, Пара.Ключ);
		Если Пара.Значение > Доступно Тогда
			Ошибки.Добавить(СтрШаблон("Недостаточно остатка для %1: доступно %2, требуется %3.",
				Строка(Пара.Ключ), Доступно, Пара.Значение));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

Функция ДоступныйОстатокНоменклатуры(Фирма, Склад, Номенклатура)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Ост.ОстатокОстаток - Ост.РезервОстаток), 0) КАК Доступно
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(
	|		,
	|		Фирма = &Фирма
	|			И Склад = &Склад
	|			И Номенклатура = &Номенклатура) КАК Ост";
	Зап.УстановитьПараметр("Фирма", Фирма);
	Зап.УстановитьПараметр("Склад", Склад);
	Зап.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Доступно = 0;
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Доступно = Выборка.Доступно;
	КонецЕсли;
	
	// Резерв проформ инвойса — регистр ТоварыВДороге (без привязки к партиям).
	//Доступно = Доступно - РезервНоменклатурыВТоварахВДороге(Склад, Номенклатура);
	
	Возврат Макс(0, Доступно);
	
КонецФункции

Функция РезервНоменклатурыВТоварахВДороге(Склад, Номенклатура)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Ост.КоличествоОстаток), 0) КАК Резерв
	|ИЗ
	|	РегистрНакопления.ТоварыВДороге.Остатки(
	|		,
	|		(Склад = &Склад
	|			ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|			И Номенклатура = &Номенклатура
	|			И ВидДороги = ЗНАЧЕНИЕ(Перечисление.ВидДороги.Резерв)) КАК Ост";
	Зап.УстановитьПараметр("Склад", Склад);
	Зап.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Макс(0, Выборка.Резерв);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция НайтиНоменклатуруПоПозиции(Позиция)
	
	Если Позиция.Свойство("itemCode") И СокрЛП(Строка(Позиция.itemCode)) <> "" Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Позиция.itemCode)));
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Если Позиция.Свойство("item") И СокрЛП(Позиция.item) <> "" Тогда
		Наименование = СокрЛП(Позиция.item);
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Ложь);
		КонецЕсли;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Функция НоменклатураИзСтрокЗаказа(СтрокиЗаказа)
	
	Уникальные = Новый Соответствие;
	МассивНоменклатуры = Новый Массив;
	Для Каждого Стр Из СтрокиЗаказа Цикл
		Если Уникальные.Получить(Стр.Номенклатура) = Неопределено Тогда
			Уникальные.Вставить(Стр.Номенклатура, Истина);
			МассивНоменклатуры.Добавить(Стр.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивНоменклатуры;
	
КонецФункции

// ─── Расходные накладные (GET /delivery-notes) ───────────────────────────────

// GET /delivery-notes — выгрузка расходной накладной в PDF или Excel.
// Параметры: number (или deliveryNoteNumber), date (опционально), format=pdf|excel, serials=with|without (по умолчанию with).
Функция ПолучитьРасходнуюНакладнуюФайл(Запрос) Экспорт
	
	Результат = Новый Структура("ДвоичныеДанные, ИмяФайла, ТипСодержимого, Ошибка, НеНайден", Неопределено, "", "", "", Ложь);
	
	НомерНакладной = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "number");
	Если НомерНакладной = "" Тогда
		НомерНакладной = StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "deliveryNoteNumber");
	КонецЕсли;
	Если НомерНакладной = "" Тогда
		Результат.Ошибка = "Укажите number (или deliveryNoteNumber) — номер расходной накладной.";
		Возврат Результат;
	КонецЕсли;
	
	ДатаНакладной = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "date");
	Если ДатаНакладной = Неопределено Тогда
		ДатаНакладной = StockAPI_Утилиты.ДатаПараметраЗапроса(Запрос, "deliveryNoteDate");
	КонецЕсли;
	
	СсылкаНакладной = НайтиРасходнуюНакладную(НомерНакладной, ?(ДатаНакладной = Неопределено, '00010101', ДатаНакладной));
	Если НЕ ЗначениеЗаполнено(СсылкаНакладной) Тогда
		Результат.Ошибка = СтрШаблон("Расходная накладная %1 не найдена.", НомерНакладной);
		Результат.НеНайден = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Формат = НРег(StockAPI_Утилиты.СтрокаПараметраЗапроса(Запрос, "format"));
	Если Формат = "" Тогда
		Формат = "pdf";
	КонецЕсли;
	
	ПараметрСерий = ПараметрВыгрузкиССериями(Запрос);
	Если ПараметрСерий.Ошибка <> "" Тогда
		Результат.Ошибка = ПараметрСерий.Ошибка;
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Если Формат = "pdf" Тогда
			Результат.ДвоичныеДанные = СформироватьPDFРасходнойНакладной(СсылкаНакладной, ПараметрСерий.ССериями);
			Результат.ИмяФайла = ИмяФайлаРасходнойНакладной(СсылкаНакладной, "pdf");
			Результат.ТипСодержимого = "application/pdf";
		ИначеЕсли Формат = "excel" Или Формат = "xlsx" Или Формат = "xls" Тогда
			Результат.ДвоичныеДанные = СформироватьExcelРасходнойНакладной(СсылкаНакладной, ПараметрСерий.ССериями);
			Результат.ИмяФайла = ИмяФайлаРасходнойНакладной(СсылкаНакладной, "xlsx");
			Результат.ТипСодержимого = "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet";
		Иначе
			Результат.Ошибка = "Неподдерживаемый format. Допустимые значения: pdf, excel.";
			Возврат Результат;
		КонецЕсли;
	Исключение
		Результат.Ошибка = "Не удалось сформировать файл накладной: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// serials=with|without (по умолчанию with). Также принимает true/false, 1/0, yes/no.
Функция ПараметрВыгрузкиССериями(Запрос)
	
	Возврат StockAPI_Утилиты.ПараметрSerialsЗапроса(Запрос, Истина);
	
КонецФункции

Функция НайтиРасходнуюНакладную(НомерНакладной, ДатаНакладной = '00010101')
	
	Если СокрЛП(НомерНакладной) = "" Тогда
		Возврат Документы.РасходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	
	Если ДатаНакладной <> '00010101' Тогда
		Ссылка = Документы.РасходнаяНакладная.НайтиПоНомеру(НомерНакладной, ДатаНакладной);
		Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.ПометкаУдаления Тогда
			Возврат Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РН.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РН
	|ГДЕ
	|	РН.Номер = &Номер
	|	И НЕ РН.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РН.Дата УБЫВ";
	Зап.УстановитьПараметр("Номер", СокрЛП(НомерНакладной));
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.РасходнаяНакладная.ПустаяСсылка();
	
КонецФункции

Функция СформироватьPDFРасходнойНакладной(СсылкаНакладной, ССериями = Истина)
	
	ТабДок = Новый ТабличныйДокумент;
	ВариантПечати = ?(ССериями, "ПоСериям", "БезСерий");
	Документы.РасходнаяНакладная.ПечатьДокумента(СсылкаНакладной, ВариантПечати, ТабДок);
	Возврат ТабличныйДокументВДвоичныеДанные(ТабДок, ТипФайлаТабличногоДокумента.PDF, "pdf");
	
КонецФункции

Функция СформироватьExcelРасходнойНакладной(СсылкаНакладной, ССериями = Истина)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	КолонокВсего = ?(ССериями, 6, 5);
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	РН.Номер КАК Номер,
	|	РН.Дата КАК Дата,
	|	РН.Контрагент.Наименование КАК Контрагент,
	|	РН.Склад.Наименование КАК Склад,
	|	РН.Валюта.Наименование КАК Валюта,
	|	РН.Сумма КАК Сумма,
	|	РН.ДокументОснование.Номер КАК НомерЗаказа
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РН
	|ГДЕ
	|	РН.Ссылка = &Ссылка";
	Зап.УстановитьПараметр("Ссылка", СсылкаНакладной);
	
	ВыборкаШапки = Зап.Выполнить().Выбрать();
	Если НЕ ВыборкаШапки.Следующий() Тогда
		ВызватьИсключение "Не удалось прочитать расходную накладную.";
	КонецЕсли;
	
	ТабДок.Область(1, 1, 1, КолонокВсего).Текст = СтрШаблон("Расходная накладная № %1 от %2",
		ВыборкаШапки.Номер, Формат(ВыборкаШапки.Дата, "ДЛФ=D"));
	ТабДок.Область(2, 1, 2, КолонокВсего).Текст = СтрШаблон("Покупатель: %1 | Склад: %2 | Валюта: %3",
		ВыборкаШапки.Контрагент, ВыборкаШапки.Склад, ВыборкаШапки.Валюта);
	Если ЗначениеЗаполнено(ВыборкаШапки.НомерЗаказа) Тогда
		ТабДок.Область(3, 1, 3, КолонокВсего).Текст = "Заказ: " + ВыборкаШапки.НомерЗаказа;
	КонецЕсли;
	
	СтрокаЗаголовков = 5;
	ТабДок.Область(СтрокаЗаголовков, 1).Текст = "Номенклатура";
	ТабДок.Область(СтрокаЗаголовков, 2).Текст = "Код";
	ТабДок.Область(СтрокаЗаголовков, 3).Текст = "Количество";
	ТабДок.Область(СтрокаЗаголовков, 4).Текст = "Цена продажи";
	ТабДок.Область(СтрокаЗаголовков, 5).Текст = "Сумма";
	Если ССериями Тогда
		ТабДок.Область(СтрокаЗаголовков, 6).Текст = "Серийный номер";
	КонецЕсли;
	
	ЗапТовары = Новый Запрос;
	Если ССериями Тогда
		ЗапТовары.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура.Наименование КАК Номенклатура,
		|	Товары.Номенклатура.Код КАК Код,
		|	Товары.Количество КАК Количество,
		|	Товары.ЦенаПродажи КАК ЦенаПродажи,
		|	Товары.СуммаПродажи КАК СуммаПродажи,
		|	Товары.Серия КАК Серия,
		|	Товары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товары.НомерСтроки";
	Иначе
		ЗапТовары.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура.Наименование КАК Номенклатура,
		|	Товары.Номенклатура.Код КАК Код,
		|	СУММА(Товары.Количество) КАК Количество,
		|	Товары.ЦенаПродажи КАК ЦенаПродажи,
		|	СУММА(Товары.СуммаПродажи) КАК СуммаПродажи,
		|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.Номенклатура.Наименование,
		|	Товары.Номенклатура.Код,
		|	Товары.ЦенаПродажи
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	ЗапТовары.УстановитьПараметр("Ссылка", СсылкаНакладной);
	
	НомерСтроки = СтрокаЗаголовков + 1;
	ВыборкаТовары = ЗапТовары.Выполнить().Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		ТабДок.Область(НомерСтроки, 1).Текст = ВыборкаТовары.Номенклатура;
		ТабДок.Область(НомерСтроки, 2).Текст = Формат(ВыборкаТовары.Код, "ЧГ=0");
		ТабДок.Область(НомерСтроки, 3).Текст = ВыборкаТовары.Количество;
		ТабДок.Область(НомерСтроки, 4).Текст = ВыборкаТовары.ЦенаПродажи;
		ТабДок.Область(НомерСтроки, 5).Текст = ВыборкаТовары.СуммаПродажи;
		Если ССериями Тогда
			ТабДок.Область(НомерСтроки, 6).Текст = СокрЛП(ВыборкаТовары.Серия);
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ТабДок.Область(НомерСтроки, 4).Текст = "Итого:";
	ТабДок.Область(НомерСтроки, 5).Текст = ВыборкаШапки.Сумма;
	
	Возврат ТабличныйДокументВДвоичныеДанные(ТабДок, ТипФайлаТабличногоДокумента.XLSX, "xlsx");
	
КонецФункции

Функция ТабличныйДокументВДвоичныеДанные(ТабДок, ТипФайла, Расширение)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("." + Расширение);
	ТабДок.Записать(ИмяФайла, ТипФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция ИмяФайлаРасходнойНакладной(СсылкаНакладной, Расширение)
	
	БезопасныйНомер = СтрЗаменить(СокрЛП(СсылкаНакладной.Номер), "/", "-");
	БезопасныйНомер = СтрЗаменить(БезопасныйНомер, "\", "-");
	Возврат "delivery-note-" + БезопасныйНомер + "." + Расширение;
	
КонецФункции
